esoeproject/esoeproject/saml2cpp/include/saml2/handlers/impl/MarshallerImpl.h
/*
 * Copyright 2006-2007, Queensland University of Technology
 * Licensed under the Apache License, Version 2.0 (the "License"); you may not 
 * use this file except in compliance with the License. You may obtain a copy of 
 * the License at 
 * 
 *   http://www.apache.org/licenses/LICENSE-2.0 
 * 
 * Unless required by applicable law or agreed to in writing, software 
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT 
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the 
 * License for the specific language governing permissions and limitations under 
 * the License.
 * 
 * Author: Bradley Beddoes
 * Creation Date: 19/12/2006
 * 
 * Purpose: Concrete implementation of all marshalling operations supported by saml2lib-cpp
 */

#ifndef MARSHALLERIMPL_H_
#define MARSHALLERIMPL_H_

/* OpenSSL */
#include <openssl/bio.h>
#include <openssl/evp.h>
#include <openssl/pem.h>

/* STL */
#include <map>
#include <vector>
#include <string>

/* XML Security */
#include <xsec/dsig/DSIGSignature.hpp>
#include <xsec/enc/OpenSSL/OpenSSLCryptoKeyRSA.hpp>
#include <xsec/framework/XSECException.hpp>

/* Xerces */
#include <xercesc/dom/DOMDocument.hpp>
#include <xercesc/dom/DOMElement.hpp>
#include <xercesc/dom/DOMImplementation.hpp>
#include <xercesc/dom/DOMWriter.hpp>
#include <xercesc/dom/DOMException.hpp>
#include <xercesc/framework/MemBufFormatTarget.hpp>
#include <xercesc/framework/MemBufInputSource.hpp>
#include <xercesc/sax/SAXException.hpp>
#include <xercesc/util/XMLException.hpp>

/* XSD */
#include <xsd/cxx/tree/elements.hxx>
#include <xsd/cxx/tree/exceptions.hxx>

/* Local Codebase */
#include "saml2/exceptions/InvalidParameterException.h"
#include "saml2/exceptions/MarshallerException.h"
#include "saml2/handlers/Marshaller.h"
#include "saml2/handlers/SAMLDocument.h"
#include "saml2/namespace/NamespacePrefixMapper.h"
#include "saml2/SAML2Defs.h"

XERCES_CPP_NAMESPACE_USE

namespace saml2
{
	/*
	 * Concrete implementation of marshalling operations supported by the library.
	 */
	template <class T>
	class MarshallerImpl : public saml2::Marshaller<T>
	{
		public:
			MarshallerImpl( std::string schemaDir, std::vector<std::string> schemaList, std::string rootElementName, std::string namespaceURI );
			MarshallerImpl( std::string schemaDir, std::vector<std::string> schemaList, std::string rootElementName, std::string namespaceURI, std::string keyPairName, XSECCryptoKey* pk );
			~MarshallerImpl();

			SAMLDocument  marshallSigned( T*  xmlObj, std::vector<std::string> idList );
			SAMLDocument  marshallUnSigned( T*  xmlObj, bool addNamespaces = true  );
			SAMLDocument  marshallUnSignedElement( T*  xmlObj );
			SAMLDocument  generateOutput ( DOMElement* elem );
			DOMElement* generateDOMElement( T* xmlObj );
			DOMDocument* generateDOMDocument( T* xmlObj, bool addNamespaces = true );
			void sign (DOMDocument* domDoc, std::vector<std::string> idList);
			DOMDocument* validate (DOMDocument* domDoc);
			
		private:
			std::string schemaDir;
			std::vector<std::string> schemaList;
			std::string rootElementName;
			std::string namespaceURI;

			XMLCh* defaultURI;
			XMLCh* rootElement;
			XMLCh* xmlns;
			XMLCh* implFlags;
			XMLCh* encoding;
			XMLCh* dsigURI;
			XMLCh* dsigSigElem;
			XMLCh* dsigNS;
			XMLCh* dsigKeyPairName;
			XMLCh* samlSiblingInsertAfter;

			DOMImplementation* domImpl;
			XSECCryptoKey* pk;

			NamespacePrefixMapper namespaceMapper;

			SAML2ErrorHandler* errorHandler;
			ResourceResolver* resourceResolver;

			void init();
			
			DOMImplementation* generateDOMImplementation();
			SAMLDocument generateOutput ( DOMDocument* domDoc );
	};

	/*
	 * Constructor for marshaller instances that are not required to do any cryptography
	 */
	template <class T>
	MarshallerImpl<T>::MarshallerImpl( std::string schemaDir, std::vector<std::string> schemaList, std::string rootElementName, std::string namespaceURI )
	{
		this->schemaDir = schemaDir;
		this->schemaList = schemaList;
		
		this->rootElementName = rootElementName;
		this->namespaceURI = namespaceURI;
		
		this->pk = NULL;
		
		this->dsigKeyPairName = NULL;

		init();
	}

	/*
	 * Constructor for marshaller instances that are required to do cryptography.
	 * 
	 * Caller is responsible for memory management of all passed data.
	 */
	template <class T>
	MarshallerImpl<T>::MarshallerImpl( std::string schemaDir, std::vector<std::string> schemaList, std::string rootElementName, std::string namespaceURI, std::string keyPairName, XSECCryptoKey* pk )
	{
		if(pk == NULL)
			SAML2LIB_INVPARAM_EX("Supplied private key was NULL");
		
		this->schemaDir = schemaDir;
		this->schemaList = schemaList;
		
		this->rootElementName = rootElementName;
		this->namespaceURI = namespaceURI;
		
		this->pk = pk;

		init();
		this->dsigKeyPairName = XMLString::transcode(keyPairName.c_str());
	}

	/*
	 * Destructor, frees all memory and terminates usage of Xerces and XSEC
	 */
	template <class T>
	MarshallerImpl<T>::~MarshallerImpl()
	{
		// No need to 'NULL' the pointers here - they won't be used again.
		delete errorHandler;
		delete resourceResolver;

		XMLString::release(&defaultURI);
		XMLString::release(&rootElement);
		XMLString::release(&implFlags);
		XMLString::release(&xmlns);
		XMLString::release(&encoding);
		XMLString::release(&dsigURI);
		XMLString::release(&dsigSigElem);
		XMLString::release(&dsigNS);
		XMLString::release(&samlSiblingInsertAfter);
		
		if(dsigKeyPairName != NULL)
			XMLString::release(&dsigKeyPairName);
		
		// According to the xml-security-c API docs, Terminate() can be called once for each time Initialize() was called.
		// This means that this won't affect other instances of Marshallers that we have.
		XSECPlatformUtils::Terminate();
		XMLPlatformUtils::Terminate();
	}

	/*
	 * Initialization tasks common to both types of marshaller, initializes members,
	 * Xerces and XSEC libraries
	 */
	template <class T>
	void MarshallerImpl<T>::init()
	{
		XMLPlatformUtils::Initialize();
		XSECPlatformUtils::Initialise();
		
