esoeproject/esoeproject/saml2cpp/include/saml2/handlers/impl/MarshallerImpl.h
		if( rootElementName.find( ':' ) == std::string::npos )
		{
			std::map<const char*, const char*> namespaces = namespaceMapper.getNamespaces();
			for( std::map<const char*, const char*>::iterator namespaceIterator = namespaces.begin(); 
				namespaceIterator != namespaces.end(); 
				namespaceIterator++ )
			{
				if( namespaceURI.compare( namespaceIterator->second ) == 0 )
				{
					// Strip the leading 'xmlns:' that the namespace mapper uses
					std::string namespaceAttribute = namespaceIterator->first;
					std::size_t index = namespaceAttribute.find( ':' );
					std::string qualName = namespaceAttribute;
					if( index != std::string::npos )
					{
						qualName = namespaceAttribute.substr( index+1 );
					}
					
					this->rootElementName = qualName + ":" + rootElementName;
				}
			}
			
			// If we fall off the end of the loop without updating it, it will just stay as it was given.
		}

		this->defaultURI = XMLString::transcode(this->namespaceURI.c_str());
		this->rootElement = XMLString::transcode(this->rootElementName.c_str());
		this->implFlags = XMLString::transcode( IMPL_FLAGS );
		this->xmlns = XMLString::transcode( XMLNS );
		this->encoding = XMLString::transcode( ENCODING );
		this->dsigURI = XMLString::transcode ( DSIG_URI );
		this->dsigSigElem = XMLString::transcode ( DSIG_SIG_ELEM );
		this->dsigNS = XMLString::transcode( DSIG_NS );
		this->samlSiblingInsertAfter = XMLString::transcode( SAML_SIBLING_INSERT_AFTER );

		this->domImpl = DOMImplementationRegistry::getDOMImplementation(this->implFlags);

		this->errorHandler =  new SAML2ErrorHandler();
		this->resourceResolver = new ResourceResolver( this->schemaDir );
	}

	/*
	 * Marshalls and performs cryptography on the presented object to a DOMDocument
	 * 
	 * @param xmlObj input object of generic type which the marshaller is acting for (XSD generated)
	 * @param idList a list of ID's in the document to be signed. Id's should present in outter most to inner most order,
	 * ie: Root element Id would be presented first with subsequent Id's to be signed in the document coming later,
	 * all Id's in each "branch" of the document must be presented before moving to the next branch
	 * 
	 * @exception MarshallerException, wrapped exception detailing error state
	 * @exception InvalidParameterException, when invalid data is fed to the library
	 */
	template <class T>
	SAMLDocument MarshallerImpl<T>::marshallSigned ( T*  xmlObj, std::vector<std::string> idList )
	{
		DOMDocument* domDoc = NULL;
		SAMLDocument samlDocument;
		
		if(xmlObj == NULL)
			SAML2LIB_INVPARAM_EX("Supplied xml object was NULL");
		
		if(this->dsigKeyPairName == NULL)
			SAML2LIB_MAR_EX( "Incorrect constructor called for signing document, re-initialise marshaller correctly" );

		try
		{
			domDoc = this->generateDOMDocument ( xmlObj );
			domDoc = validate(domDoc);

			sign(domDoc, idList);
			samlDocument = this->generateOutput( domDoc );
			domDoc->release();
			domDoc = NULL;
		}
		catch(xsd::cxx::tree::serialization< wchar_t >  &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "XSD Serialization exception while marshalling signed document", exc.what() );
		}
		catch(xsd::cxx::tree::expected_element< wchar_t >  &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "XSD Excpected Element exception while marshalling signed document", exc.what() );
		}
		catch(xsd::cxx::tree::no_namespace_mapping< wchar_t >  &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "XSD No Namespace Mapping exception while marshalling signed document", exc.what() );
		}
		catch(xsd::cxx::tree::no_prefix_mapping< wchar_t >  &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "XSD No Prefix Mapping exception while marshalling signed document", exc.what() );
		}
		catch(xsd::cxx::tree::xsi_already_in_use< wchar_t >  &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "XSD XSI Already In Use exception while marshalling signed document", exc.what() );
		}
		catch(xsd::cxx::tree::exception< wchar_t >  &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "XSD generic exception while marshalling signed document", exc.what() );
		}
		catch (std::bad_alloc &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "Bad memory alloc while marshalling signed document", exc.what() );
		}
		catch(SAXException &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "SAXException while marshalling signed document", exc.getMessage() );
		}
		catch(DOMException &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "DOMException while marshalling signed document", exc.getMessage() );
		}
		catch(XMLException &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "XMLException while marshalling signed document", exc.getMessage() );
		}
		catch(std::exception &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "Exception while marshalling signed document", exc.what() );
		}
		catch(...)
		{
			SAML2LIB_MAR_EX( "Generic exception while marshalling signed document" );
		}
		
		return samlDocument;
	}

	/*
	 * Marshalls the presented object to a DOMDocument
	 * 
	 * @param xmlObj input object of generic type which the marshaller is acting for (XSD generated)
	 *
 	 * @exception MarshallerException, wrapped exception detailing error state
	 * @exception InvalidParameterException, when invalid data is fed to the library
 	 */
	template <class T>
	SAMLDocument MarshallerImpl<T>::marshallUnSigned (T* xmlObj, bool addNamespaces)
	{
		DOMDocument* domDoc;
		SAMLDocument samlDocument;

		if(xmlObj == NULL)
			SAML2LIB_INVPARAM_EX("Supplied xml object was NULL");
			
		try
		{
			domDoc = this->generateDOMDocument ( xmlObj, addNamespaces );
			samlDocument = this->generateOutput( domDoc );
			domDoc->release();
			domDoc = NULL;
		}
		catch(xsd::cxx::tree::serialization< wchar_t >  &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "XSD Serialization exception while marshalling unsigned document", exc.what() );
		}
		catch(xsd::cxx::tree::expected_element< wchar_t >  &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "XSD Excpected Element exception while marshalling unsigned document", exc.what() );
		}
		catch(xsd::cxx::tree::no_namespace_mapping< wchar_t >  &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "XSD No Namespace Mapping exception while marshalling unsigned document", exc.what() );
		}
		catch(xsd::cxx::tree::no_prefix_mapping< wchar_t >  &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "XSD No Prefix Mapping exception while marshalling unsigned document", exc.what() );
		}
		catch(xsd::cxx::tree::xsi_already_in_use< wchar_t >  &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "XSD XSI Already In Use exception while marshalling unsigned document", exc.what() );
		}
		catch(xsd::cxx::tree::exception< wchar_t >  &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "XSD generic exception while marshalling unsigned document", exc.what() );
		}
		catch (std::bad_alloc &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "Bad memory alloc while marshalling unsigned document", exc.what() );
		}
		catch(SAXException &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "SAXException while marshalling unsigned document", exc.getMessage() );
		}
		catch(DOMException &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "DOMException while marshalling unsigned document", exc.getMessage() );
		}
		catch(XMLException &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "XMLException while marshalling unsigned document", exc.getMessage() );
		}
		catch(std::exception &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "Exception while marshalling unsigned document", exc.what() );
		}
		catch(...)
		{
			SAML2LIB_MAR_EX( "Generic exception while marshalling unsigned document" );
		}
		
		return samlDocument;
	}

