esoeproject/esoeproject/saml2cpp/include/saml2/handlers/impl/MarshallerImpl.h
	/*
	 * Marshalls the presented object to a DOMElement
	 * 
	 * @param xmlObj input object of generic type which the marshaller is acting for (XSD generated)
	 *
 	 * @exception MarshallerException, wrapped exception detailing error state
	 * @exception InvalidParameterException, when invalid data is fed to the library
 	 */
	template <class T>
	SAMLDocument MarshallerImpl<T>::marshallUnSignedElement ( T*  xmlObj )
	{
		DOMElement* elem;
		SAMLDocument samlDocument;

		if(xmlObj == NULL)
			SAML2LIB_INVPARAM_EX("Supplied xml element was NULL");
				
		try
		{
			elem = generateDOMElement( xmlObj );
			samlDocument = this->generateOutput( elem );
		}
		catch(xsd::cxx::tree::serialization< wchar_t >  &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "XSD Serialization exception while marshalling unsigned element", exc.what() );
		}
		catch(xsd::cxx::tree::expected_element< wchar_t >  &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "XSD Excpected Element exception while marshalling unsigned element", exc.what() );
		}
		catch(xsd::cxx::tree::no_namespace_mapping< wchar_t >  &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "XSD No Namespace Mapping exception while marshalling unsigned element", exc.what() );
		}
		catch(xsd::cxx::tree::no_prefix_mapping< wchar_t >  &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "XSD No Prefix Mapping exception while marshalling unsigned element", exc.what() );
		}
		catch(xsd::cxx::tree::xsi_already_in_use< wchar_t >  &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "XSD XSI Already In Use exception while marshalling unsigned element", exc.what() );
		}
		catch(xsd::cxx::tree::exception< wchar_t >  &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "XSD generic exception while marshalling unsigned element", exc.what() );
		}
		catch (std::bad_alloc &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "Bad memory alloc while marshalling unsigned element", exc.what() );
		}
		catch(SAXException &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "SAXException while marshalling unsigned element", exc.getMessage() );
		}
		catch(DOMException &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "DOMException while marshalling unsigned element", exc.getMessage() );
		}
		catch(XMLException &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "XMLException while marshalling unsigned element", exc.getMessage() );
		}
		catch(std::exception &exc)
		{
			SAML2LIB_MAR_EX_CAUSE( "Exception while marshalling unsigned element", exc.what() );
		}
		catch(...)
		{
			SAML2LIB_MAR_EX( "Generic exception while marshalling unsigned element" );
		}
		
		return samlDocument;
	}

	/*
	 * Translates generated DOMDocument into a series of bytes to return to caller
	 */
	template <class T>
	SAMLDocument MarshallerImpl<T>::generateOutput ( DOMDocument* domDoc )
	{
		DOMWriter* writer = NULL;
		MemBufFormatTarget *formatTarget = NULL;

		try
		{
			writer = this->domImpl->createDOMWriter();
			formatTarget = new MemBufFormatTarget();

			/* Ensure we generate BOM */
			writer->setFeature(XMLUni::fgDOMWRTBOM, true);
			writer->setEncoding( this->encoding );
			writer->writeNode(formatTarget, *domDoc);

			long length = formatTarget->getLen();
			SAMLByte *document = new SAMLByte[length];
			std::memcpy(document, formatTarget->getRawBuffer(), length);

			delete formatTarget;
			formatTarget = NULL;
			
			writer->release();
			writer = NULL;
			
			return SAMLDocument( document, length );
		}
		catch(...)
		{
			if(formatTarget != NULL)
			{
				delete formatTarget;
				formatTarget = NULL;
			}

			if(writer != NULL)
			{
				writer->release();
				writer = NULL;
			}

			throw;
		}
	}
	
	/*
	 * Translates generated DOMElement into a series of bytes to return to caller
	 */
	template <class T>
	SAMLDocument MarshallerImpl<T>::generateOutput ( DOMElement* elem )
	{
		DOMWriter* writer = NULL;
		MemBufFormatTarget *formatTarget = NULL;

		try
		{
			writer = this->domImpl->createDOMWriter();
			formatTarget = new MemBufFormatTarget();

			/* Ensure we generate BOM */
			writer->setFeature(XMLUni::fgDOMWRTBOM, true);
			writer->setEncoding( this->encoding );
			writer->writeNode(formatTarget, *elem);

			long length = formatTarget->getLen();
			SAMLByte *document = new SAMLByte[length];
			std::memcpy(document, formatTarget->getRawBuffer(), length);

			delete formatTarget;
			formatTarget = NULL;
			
			writer->release();
			writer = NULL;
			
			return SAMLDocument( document, length );
		}
		catch(...)
		{
			if(formatTarget != NULL)
			{
				delete formatTarget;
				formatTarget = NULL;
			}

			if(writer != NULL)
			{
				writer->release();
				writer = NULL;
			}

			throw;
		}
	}

	/*
	 * Retrieves DOMImplmentation from Xerces registry
	 */
	template <class T>
	DOMImplementation* MarshallerImpl<T>::generateDOMImplementation()
	{
		DOMImplementation* domImpl;
		domImpl = DOMImplementationRegistry::getDOMImplementation(this->implFlags);
		return domImpl;
	}
	
	/*
	 * Utilising XSD generated code translates the supplied object into
	 * Xerces DOMDocument format for further processing
	 */
	template <class T>
	DOMDocument* MarshallerImpl<T>::generateDOMDocument( T* xmlObj, bool addNamespaces )
	{
		DOMDocument* domDoc = NULL;
		DOMElement* rootElem = NULL;

		XMLCh* uriVal = NULL;
		XMLCh* qualName = NULL;

		try
		{
			domDoc = this->domImpl->createDocument(defaultURI, rootElement, 0);
			domDoc->setStandalone(true); //TODO: confirm this is accurate
			rootElem = domDoc->getDocumentElement();

			if( addNamespaces )
			{
				std::map<const char*, const char*> namespaces = namespaceMapper.getNamespaces();
				for( std::map<const char*, const char*>::iterator i = namespaces.begin(); i != namespaces.end(); i++ )
				{
					qualName = XMLString::transcode(i->first);
					uriVal = XMLString::transcode(i->second);
					rootElem->setAttributeNS ( this->xmlns, qualName, uriVal);
	
					XMLString::release(&qualName);
					XMLString::release(&uriVal);
					uriVal = NULL;
					qualName = NULL;
				}
			}
			else
			{
				// Find the single namespace we need and add it.
				std::map<const char*, const char*> namespaces = namespaceMapper.getNamespaces();
				for( std::map<const char*, const char*>::iterator i = namespaces.begin(); i != namespaces.end(); i++ )
				{
					if( this->namespaceURI.compare( i->second ) == 0 )
					{
						qualName = XMLString::transcode(i->first);
						uriVal = XMLString::transcode(i->second);
						rootElem->setAttributeNS ( this->xmlns, qualName, uriVal);
		
