esoeproject/esoeproject/saml2cpp/include/saml2/handlers/impl/MarshallerImpl.h
						XMLString::release(&qualName);
						XMLString::release(&uriVal);
						uriVal = NULL;
						qualName = NULL;
						
						break;
					}
				}
			}

			/* Populate the root node of the generated DOMDocument with data from the supplied
			 * object generated by XSD schema translator
			 */
			*rootElem << *xmlObj;
		}
		catch(...)
		{
			if(uriVal != NULL)
			{
				XMLString::release(&uriVal);
				uriVal = NULL;
			}

			if(qualName != NULL)
			{
				XMLString::release(&qualName);
				qualName = NULL;
			}

			throw;
		}
		
		return domDoc;
	}

	/*
	 * Utilising XSD generated code translates the supplied object into
	 * Xerces DOMElement format for further processing
	 */
	template <class T>
	DOMElement* MarshallerImpl<T>::generateDOMElement( T* xmlObj )
	{
		DOMDocument* domDoc = NULL;
		DOMElement* rootElem = NULL;

		XMLCh* uriVal = NULL;
		XMLCh* qualName = NULL;

		try
		{
			domDoc = this->domImpl->createDocument(defaultURI, rootElement, 0);
			domDoc->setStandalone(true); //TODO: confirm this is accurate
			rootElem = domDoc->getDocumentElement();

			std::map<const char*, const char*> namespaces = namespaceMapper.getNamespaces();
			for( std::map<const char*, const char*>::iterator i = namespaces.begin(); i != namespaces.end(); i++ )
			{
				qualName = XMLString::transcode(i->first);
				uriVal = XMLString::transcode(i->second);
				rootElem->setAttributeNS ( this->xmlns, qualName, uriVal);

				XMLString::release(&qualName);
				XMLString::release(&uriVal);
				uriVal = NULL;
				qualName = NULL;
			}

			/* Populate the root node of the generated DOMDocument with data from the supplied
			 * object generated by XSD schema translator
			 */
			*rootElem << *xmlObj;
		}
		catch(...)
		{
			if(uriVal != NULL)
			{
				XMLString::release(&uriVal);
				uriVal = NULL;
			}

			if(qualName != NULL)
			{
				XMLString::release(&qualName);
				qualName = NULL;
			}

			throw;
		}
		
		return rootElem;
	}

	/*
	 * Utilises Xerces DOM level 3 DOMBuilder object to parse and validate the supplied DOMDocument
	 * instance, returns instance of DOMDocument generated by parsing
	 */
	template <class T>
	DOMDocument* MarshallerImpl<T>::validate (DOMDocument* domDoc)
	{
		Wrapper4InputSource* wrapedSource = NULL;
		DOMBuilder* parser = NULL;
		DOMWriter* writer = NULL;
		MemBufInputSource* inputSource = NULL;
		MemBufFormatTarget *formatTarget = NULL;
		XMLCh* schema = NULL;

		try
		{
			parser = this->domImpl->createDOMBuilder(DOMImplementationLS::MODE_SYNCHRONOUS, NULL);

			/* Setup all the required parser variables, NB dont trust 'defaults' */
			parser->setErrorHandler(this->errorHandler);
			parser->setEntityResolver(this->resourceResolver);

			parser->setFeature(XMLUni::fgXercesSchema, true);
			parser->setFeature(XMLUni::fgDOMValidation, true);
			parser->setFeature(XMLUni::fgDOMNamespaces, true);
			parser->setFeature(XMLUni::fgDOMWhitespaceInElementContent, false);
			parser->setFeature(XMLUni::fgXercesUseCachedGrammarInParse, true);
			parser->setFeature(XMLUni::fgXercesUserAdoptsDOMDocument, true);

			/* This is particuarly important so that signatures are not corrupted*/
			parser->setFeature(XMLUni::fgDOMDatatypeNormalization, false);

			for(std::vector<std::string>::iterator i = this->
			        schemaList.begin();
			        i != this->schemaList.end();
			        i++)
			{
				schema = XMLString::transcode ( i->c_str() );
				parser->loadGrammar(schema, Grammar::SchemaGrammarType, true);
				XMLString::release(&schema);
			}

			/* Xerces parser requires input in the form of a mem buffer and can't at this time
			 * take a straight DOMDocument, use the DOMWriter below to set up the environment for validating
			 * our outgoing XML representation
			 */
			writer = (this->domImpl->createDOMWriter ());
			formatTarget = new MemBufFormatTarget();

			/* This is particuarly important so that signatures are not corrupted*/
			writer->setFeature(XMLUni::fgDOMWRTDiscardDefaultContent, false);

			writer->setEncoding( this->encoding );
			writer->writeNode(formatTarget, *domDoc);
			
			writer->release();
			writer = NULL;
			
			domDoc->release();
			domDoc = NULL;
			
			inputSource = new MemBufInputSource( formatTarget->getRawBuffer(), formatTarget->getLen(), MARSHALLER_ID );
			wrapedSource = new Wrapper4InputSource(inputSource);
			domDoc = parser->parse(*wrapedSource);

			parser->release();
			parser = NULL;
			
			wrapedSource->release();
			wrapedSource = NULL;
			
			delete formatTarget;
		}
		catch(...)
		{
			/* Clean up any memory allocated and throw back up stack */
			if(schema != NULL)
			{
				XMLString::release(&schema);
				schema = NULL;
			}

			if(writer != NULL)
			{
				writer->release();
				writer = NULL;
			}

			if(domDoc != NULL)
			{
				domDoc->release();
				domDoc = NULL;
			}

			if (wrapedSource != NULL)
			{
				wrapedSource->release();
				wrapedSource = NULL;
			}
				
			if(parser != NULL)
			{
				parser->release();
				parser = NULL;
			}

			throw;
		}
		
		return domDoc;
	}

	/*
	 * Performs all cryptography operations associated with signing the supplied domDocument,
	 * utilises the apache XML Security C library
	 */
	template <class T>
	void MarshallerImpl<T>::sign (DOMDocument* domDoc, std::vector<std::string> idList)
	{
		XSECProvider prov;
		DSIGSignature* sig = NULL;
		DOMElement* sigNode = NULL;
		DOMElement* elem = NULL;;
		DSIGReference* ref = NULL;
		
		XMLCh* id = NULL;
		XMLCh* refURL = NULL;
		std::string currentId;
		
		try
		{										
			for(std::vector<std::string>::reverse_iterator i = idList.rbegin(); i < idList.rend(); i++)
			{
				/* Create Id and reference URL data types to xmldisg spec */
				currentId = *i;
				
				id = XMLString::transcode( currentId.c_str() );	
				currentId.insert(0, DSIG_ID_LEAD_CH);
				refURL = XMLString::transcode( currentId.c_str() );
							
				/* Get the parent element for which we wish to create a signature by Id, create a new signature element
				 * assign the Marshaller private key for signing purposes, create all references and sign the actual document.
				 * This process is repeated for each Id the caller wishes to sign in the reverse order to which Id's are presented,
				 * to ensure that outer signature blocks are calculated with inner signature blocks as part of the byte stream.
				 */
				elem = domDoc->getElementById( id );
				
				if(elem == NULL)
					SAML2LIB_MAR_EX( "Provided Id was not able to be located in document as a reference to a suitable parent element" );
					
				sig = prov.newSignature();
				sig->setDSIGNSPrefix( this->dsigNS );
				sig->setECNSPrefix( NULL );
				sig->setXPFNSPrefix( NULL );
				sig->setPrettyPrint( false );
				
				sigNode = sig->createBlankSignature(domDoc, CANON_C14NE_NOC, SIGNATURE_RSA, HASH_SHA1);
				/* Keydata is cloned and owned by crypto library here which it will clean up */
				// TODO Probably leaking memory here - I think you need to delete the cloned key -SM
				sig->setSigningKey(this->pk->clone());
				sig->appendKeyName(this->dsigKeyPairName, false);
				
				ref = sig->createReference( refURL, HASH_SHA1);
				ref->appendEnvelopedSignatureTransform();
				ref->appendCanonicalizationTransform(CANON_C14NE_NOC);
	
				if(elem->hasChildNodes())
				{
					/* This needs to be investigated further when time permits to find a better way to position
					 * the generated Signature element to ensure a valid document, at the moment with SAML 2.0 schema
					 * we know the Signature block is either the first child of the parent node or the second child of the parent node
					 * if an optional Issuer element is present, at any rate its not 100% clean and should be fixed up
					 */
					if( XMLString::equals(elem->getFirstChild()->getNodeName(), samlSiblingInsertAfter) )
						if(elem->getFirstChild()->getNextSibling() == NULL)
							elem->appendChild(sigNode);
						else
							elem->insertBefore(sigNode, elem->getFirstChild()->getNextSibling());
					else
						elem->insertBefore(sigNode, elem->getFirstChild());
				}
				else
				{
					elem->appendChild(sigNode);
				}
	
				sig->sign();	
				prov.releaseSignature(sig);
				sig = NULL;
				
				XMLString::release(&id);
				id = NULL;
				XMLString::release(&refURL);
				refURL = NULL;
			}
		}
		catch (XSECCryptoException &exc)
		{		
			if(domDoc != NULL)
			{
				domDoc->release();
				domDoc = NULL;
			}
				
			if(sig != NULL)
			{
				prov.releaseSignature(sig);
				sig = NULL;
			}
				
			if(id != NULL)
			{
				XMLString::release(&id);
				id = NULL;
			}
				
			if(refURL != NULL)
			{
				XMLString::release(&refURL);
				refURL = NULL;
			}
				
			SAML2LIB_MAR_EX_CAUSE( "An exception occurred during an encryption operation", exc.getMsg() );
		}
		catch (XSECException &exc)
		{
			if(domDoc != NULL)
			{
				domDoc->release();
				domDoc = NULL;
			}
				
			if(sig != NULL)
			{
				prov.releaseSignature(sig);
				sig = NULL;
			}
				
			if(id != NULL)
			{
				XMLString::release(&id);
				id = NULL;
			}
				
			if(refURL != NULL)
			{
				XMLString::release(&refURL);
				refURL = NULL;
			}
				
			SAML2LIB_MAR_EX_CAUSE( "An exception occurred during a security operation", exc.getMsg() );
		}
		catch(...)
		{
			if(domDoc != NULL)
			{
				domDoc->release();
				domDoc = NULL;
			}
				
			if(sig != NULL)
			{
				prov.releaseSignature(sig);
				sig = NULL;
			}
				
			if(id != NULL)
			{
				XMLString::release(&id);
				id = NULL;
			}
				
			if(refURL != NULL)
			{
				XMLString::release(&refURL);
				refURL = NULL;
			}
				
			throw;
		}
	}
}

#endif /*MARSHALLERIMPL_H_*/
